// Workshop #2
// ให้เขียนโปรแกรมที่ตรวจสอบอายุของผู้ใช้และแสดงข้อความตามช่วงอายุ (เด็ก, วัยรุ่น, ผู้ใหญ่) โดยจะรับข้อมูลมาเป็นอายุ และจะแสดงผลตามนี้
// ถ้าอายุน้อยกว่า 13 ปี ให้แสดงเป็นคำว่า คุณเป็นเด็ก
// ถ้าอายุมากกว่า 13 แต่ น้อยกว่า 20 ปี ให้แสดงเป็นคำว่า คุณเป็นวัยรุ่น
// ถ้าอายุมากกว่า 20 ปี ให้แสดงคำว่า คุณเป็นผู้ใหญ่
type age = number
let input:age = 10;
if(input > 13) {
    console.log("คุณเป็นเด็ก");
}
else if(input > 18) {
    console.log("คุณเป็นวัยรุ่น");
} else {
    console.log("คุณเป็นผู้ใหญ่");
}
